index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-03 Sat 12:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Classical Scale Work and Improvisation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tom Ed White" />
</head>
<body>
<div id="content">
<h1 class="title">Classical Scale Work and Improvisation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org901c149">Introduction</a></li>
<li><a href="#org1a4cc1f">Common questions?</a></li>
<li><a href="#org50b7b14">Can I do this?</a></li>
<li><a href="#orgbe4100e">A paradox</a></li>
<li><a href="#org3115ff5">You have to immerse yourself in a musical community</a></li>
<li><a href="#orgc46a3a8">You can do a lot on your own</a></li>
<li><a href="#orgfb01347">Let's play some scales from Hřímalý</a></li>
<li><a href="#org052cbe8">Hřímalý without the notes</a></li>
<li><a href="#org2af20da">Ševčík patterns</a></li>
<li><a href="#org5e8e83f">Miguel Atwood-Ferguson</a></li>
<li><a href="#orgc61aa7e">Make up a pattern</a></li>
<li><a href="#org8e0c2c0">Conclusion</a></li>
<li><a href="#org835dd1a">Next steps</a></li>
<li><a href="#org8c87dc6">Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-org901c149" class="outline-2">
<h2 id="org901c149">Introduction</h2>
<div class="outline-text-2" id="text-org901c149">
<p>
Play anything that pops into your head.
</p>

<p>
Play anything you hear.
</p>

<p>
Without thinking, the same way that you talk.
</p>
</div>

<div id="outline-container-org16fb126" class="outline-3">
<h3 id="org16fb126">Me</h3>
<div class="outline-text-3" id="text-org16fb126">
<p>
I am an amateur musician who performs a lot in the community where I live, in multiple genres.
</p>

<p>
Mostly on viola, but I also play the violin, tenor banjo, and I sing a lot.
</p>
</div>
</div>
</div>

<div id="outline-container-org1a4cc1f" class="outline-2">
<h2 id="org1a4cc1f">Common questions?</h2>
</div>

<div id="outline-container-org50b7b14" class="outline-2">
<h2 id="org50b7b14">Can I do this?</h2>
<div class="outline-text-2" id="text-org50b7b14">
<p>
Yes we can.
</p>
<div class="NOTES">
<p>
Universal ability, but skill development required.
</p>

<p>
Estimated time frame: 2nd language.
</p>

</div>
<p>
Should I do this?
</p>
<div class="NOTES">
<p>
The power to play in multiple genres
</p>

<p>
Self reliance
</p>

</div>
</div>
</div>
<div id="outline-container-orgbe4100e" class="outline-2">
<h2 id="orgbe4100e">A paradox</h2>
<div class="outline-text-2" id="text-orgbe4100e">
<p>
It comes naturally to everyone.
</p>

<p>
But it takes time.
</p>
</div>
</div>
<div id="outline-container-org3115ff5" class="outline-2">
<h2 id="org3115ff5">You have to immerse yourself in a musical community</h2>
<div class="outline-text-2" id="text-org3115ff5">
<p>
There is no substitute for making friends.
</p>
</div>
</div>

<div id="outline-container-orgc46a3a8" class="outline-2">
<h2 id="orgc46a3a8">You can do a lot on your own</h2>
<div class="outline-text-2" id="text-orgc46a3a8">
<p>
It's like practicing with Rosetta Stone.
</p>

<p>
This type of practicing evolved as an important part of jazz training.
</p>

<p>
Jazz people have developed a lot of effective pedagogy, which can be used for any genre.
</p>

<p>
This type of practicing and traditional classical scale work overlap somewhat.
</p>

<p>
I will show you some of the overlap, and give you a taste of this type of training.
</p>
</div>
</div>

<div id="outline-container-orgfb01347" class="outline-2">
<h2 id="orgfb01347"><a href="./Images/hrm.pdf">Let's play some scales from Hřímalý</a></h2>
<div class="outline-text-2" id="text-orgfb01347">
<div class="NOTES">
<p>
Click on the title to open Hřímalý printout.
</p>

<p>
Play the first scale through to get everyone comfortable. Skip the middle
triplets. Play all scales in sequence.
</p>

<p>
Encourage violists and cellists to think in terms of one octave scales,
ignoring the notation in treble clef.
</p>

<p>
Close the pdf page. Play D and G patterns from memory. Play A scale, and
encourage violists and cellists to chose whichever octave they like.
</p>

<p>
Repeat with C scale, with the violinists chosing whichever octave they prefer.
</p>

</div>
</div>
</div>


<div id="outline-container-org052cbe8" class="outline-2">
<h2 id="org052cbe8"><a href="./Images/hrmc.pdf">Hřímalý without the notes</a></h2>
<div class="outline-text-2" id="text-org052cbe8">
<div class="NOTES">
<p>
Play original finger pattern, then different pattern starting on another finger.
</p>

</div>
</div>
</div>


<div id="outline-container-org2af20da" class="outline-2">
<h2 id="org2af20da"><a href="./Images/stv.pdf">Ševčík patterns</a></h2>
</div>

<div id="outline-container-org5e8e83f" class="outline-2">
<h2 id="org5e8e83f"><a href="./Images/Phrase-Codex.pdf">Miguel Atwood-Ferguson</a></h2>
<div class="outline-text-2" id="text-org5e8e83f">
<div class="NOTES">
<p>
Memorize pattern with participants. Pull up circle of fifths and play pattern through D and G major only.
</p>

<p>
Play the pattern slowly in F. Suggest either playing in 2nd position with the same finger pattern, or playing in 1st position with a different pattern.
</p>

<p>
Repeat in Bb. 
</p>

<p>
Discuss playing patterns through the entire circle, shifting or changing finger patterns as needed.
</p>

</div>
</div>
</div>

<div id="outline-container-orgc61aa7e" class="outline-2">
<h2 id="orgc61aa7e">Make up a pattern</h2>
<div class="outline-text-2" id="text-orgc61aa7e">
<div class="NOTES">
<p>
Invite a volunteer to come forward.
</p>

<p>
Make up a simple phrase that fits into 4/4 time signature.
</p>

<p>
Have everyone play together.
</p>

</div>
</div>
</div>

<div id="outline-container-org8e0c2c0" class="outline-2">
<h2 id="org8e0c2c0">Conclusion</h2>
<div class="outline-text-2" id="text-org8e0c2c0">
<p>
You can memorize the circle of fifths, and become completely comfortable with jumping around the circle.
</p>

<p>
Get comfortable with playing through the circle with various scale and phrase patterns, without thinking about key sigs.
</p>

<p>
Make things up; fool around; have fun.
</p>

<p>
It's a natural but long process, like learning a foreign language. 
</p>

<p>
Total fluency is a lifelong goal.
</p>

<p>
If you are participating in a musical community, your rate of progress will skyrocket.
</p>
</div>
</div>

<div id="outline-container-org835dd1a" class="outline-2">
<h2 id="org835dd1a">Next steps</h2>
<div class="outline-text-2" id="text-org835dd1a">
</div>
<div id="outline-container-org27e8b0e" class="outline-3">
<h3 id="org27e8b0e">Song forms</h3>
<div class="outline-text-3" id="text-org27e8b0e">
<p>
Navigate a song without measure numbers or sections designated by letters.
Learn songs efficiently, using standard forms as a departure point.
</p>
</div>
</div>
<div id="outline-container-org86a3706" class="outline-3">
<h3 id="org86a3706">Basic modality and chord symbols</h3>
<div class="outline-text-3" id="text-org86a3706">
<p>
Get fluency in the five additional diatonic modes, in addition to major and minor.
</p>
</div>
</div>

<div id="outline-container-orgaa1d42c" class="outline-3">
<h3 id="orgaa1d42c">Chord shapes and forms on violin, viola, and cello</h3>
<div class="outline-text-3" id="text-orgaa1d42c">
<p>
Put a mando chord chart on this one.
80% of playing is supporting other players, 20% is soloing. Make this sentence a link.
</p>
</div>
</div>
<div id="outline-container-org805627a" class="outline-3">
<h3 id="org805627a">Find your voice.</h3>
</div>
</div>
<div id="outline-container-org8c87dc6" class="outline-2">
<h2 id="org8c87dc6">Resources</h2>
<div class="outline-text-2" id="text-org8c87dc6">
<p>
This presentation:
</p>

<p>
<a href="https://wtomed.github.io/scale-improv">https://wtomed.github.io/scale-improv</a>
</p>

<p>
Please feel free to use it as you see fit, and send me suggestions.
</p>
</div>

<div id="outline-container-org957536f" class="outline-3">
<h3 id="org957536f">Miguel Atwood-Ferguson Phrase Codex Site</h3>
<div class="outline-text-3" id="text-org957536f">
<p>
<a href="https://www.dropbox.com/sh/cti43ph1n7mpxc1/AAAv_bbnQMdiSIblPU0tesb8a?dl=0&amp;fbclid=IwAR1j4EJcBzRxL05sQMF2OF7quEyuw6jecJH_DotTA3ONpdbPThhQX-zUwjs">https://www.dropbox.com/sh/cti43ph1n7mpxc1/AAAv_bbnQMdiSIblPU0tesb8a?dl=0&amp;fbclid=IwAR1j4EJcBzRxL05sQMF2OF7quEyuw6jecJH_DotTA3ONpdbPThhQX-zUwjs</a>
</p>
</div>
</div>

<div id="outline-container-org3aa944e" class="outline-3">
<h3 id="org3aa944e">Summer workshops</h3>
<div class="outline-text-3" id="text-org3aa944e">
<p>
<a href="https://christianhowes.com/education/creative-strings-workshop/csw-registration/">Christian Howes</a>
</p>

<p>
<a href="https://www.markoconnor.com/home">Mark O'Connor</a>
</p>

<p>
<a href="https://swangathering.com">Swannanoa Summer Gathering</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tom Ed White</p>
<p class="date">Created: 2018-11-03 Sat 12:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
